In [85]:
import pandas as pd

In [86]:
# 데이터 준비
# 데이터 준비
data={'name':['홍길동','마징가','원더우먼'],
      'job':['의적','로봇','영웅'],
      'gender':['남','남','여'],
      'age':[100, 200, 300],
      'height':[180,300,200]}

In [87]:
dataDF=pd.DataFrame(data)
dataDF

   name job gender  age  height
0   홍길동  의적      남  100     180
1   마징가  로봇      남  200     300
2  원더우먼  영웅      여  300     200

In [88]:
dataDF.loc[0,'gender']

'남'

In [89]:
dataDF.iloc[0,2]

'남'

In [90]:
dataDF['gender'][0]

'남'

In [91]:
dataDF.iloc[0,2] = '여'
dataDF

   name job gender  age  height
0   홍길동  의적      여  100     180
1   마징가  로봇      남  200     300
2  원더우먼  영웅      여  300     200

In [92]:
dataDF.iloc[2,1]='직장인'
dataDF

   name  job gender  age  height
0   홍길동   의적      여  100     180
1   마징가   로봇      남  200     300
2  원더우먼  직장인      여  300     200

In [93]:
dataDF.iloc[1]

name      마징가
job        로봇
gender      남
age       200
height    300
Name: 1, dtype: object

In [94]:
dataDF.iloc[1]=['마징가2','영웅','여',90,170]
dataDF

   name  job gender  age  height
0   홍길동   의적      여  100     180
1  마징가2   영웅      여   90     170
2  원더우먼  직장인      여  300     200

In [95]:
dataDF.iloc[1]=0
dataDF

   name  job gender  age  height
0   홍길동   의적      여  100     180
1     0    0      0    0       0
2  원더우먼  직장인      여  300     200

In [96]:
dataDF.height=0
dataDF

   name  job gender  age  height
0   홍길동   의적      여  100       0
1     0    0      0    0       0
2  원더우먼  직장인      여  300       0